app/controllers/pictures_controller.rb

  def index
    @pictures = Picture.where(:user_id => current_user_id)
---
SELECT "pictures".* FROM "pictures" WHERE "pictures"."user_id" = ? LIMIT ?  [["user_id", 14], ["LIMIT", 1]]

  def create
    @picture = Picture.new(picture_params)
    @picture.user_id = current_user_id
    respond_to do |format|
      if @picture.save
---
INSERT INTO "pictures" ("created_at", "updated_at", "user_id") VALUES (?, ?, ?)  [["created_at", "2021-01-16 18:23:18.740653"], ["updated_at", "2021-01-16 18:23:18.740653"], ["user_id", 5]]

  def update
    respond_to do |format|
      if @picture.update(picture_params)
---
UPDATE "pictures" SET "updated_at" = ? WHERE "pictures"."id" = ?  [["updated_at", "2021-01-16 19:33:54.225834"], ["id", 4]]

  def destroy
    @picture.destroy
---
DELETE FROM "pictures" WHERE "pictures"."id" = ?  [["id", 8]]